# PANDAS

In [383]:
import pandas as pd

data = {
    'Date': ['2016-03-01', '2015-02-01', '2016-03-01', '2014-02-02' , '2014-02-02'],
    'Type': ['a', 'b', 'c', 'a', 'b'],
    'Value': [11.432, 13.031, 20.784, 99.01, 1]
}

data2 = {
    'Date': ['2016-03-01', '2015-02-01', '2016-03-01', '2014-02-02' , '2014-02-02'],
    'Type': ['a', 'b', 'c', 'a', 'a'],
    'Value': [11.432, 13.031, 20.784, 99.01, 1]
}
df =pd.DataFrame(data)

## ================= DataFrame =================

In [93]:
pd.DataFrame(data)

         Date Type   Value
0  2016-03-01    a  11.432
1  2015-02-01    b  13.031
2  2016-03-01    c  20.784
3  2014-02-02    a  99.010
4  2014-02-02    b   1.000

## ================= Series =================

In [92]:
import numpy as np

pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])

a    1
b    2
c    3
d    4
e    5
dtype: int64

## ================= DataFrame =================

In [108]:
pd.DataFrame(pd.DataFrame(data), columns = ['Date', 'Type'])

         Date Type
0  2016-03-01    a
1  2015-02-01    b
2  2016-03-01    c
3  2014-02-02    a
4  2014-02-02    b

## ================= Pivot =================

In [117]:
pd.pivot(pd.DataFrame(data), values='Value', index='Date', columns='Type')

Type             a       b       c
Date
2014-02-02  99.010   1.000     NaN
2015-02-01     NaN  13.031     NaN
2016-03-01  11.432     NaN  20.784

## ================= Melt =================

In [104]:
 pd.melt(
     pd.DataFrame(data), 
     id_vars=["Date"],
     value_vars=["Type", "Value"],
     value_name="Vals")

         Date variable    Vals
0  2016-03-01     Type       a
1  2015-02-01     Type       b
2  2016-03-01     Type       c
3  2014-02-02     Type       a
4  2014-02-02     Type       b
5  2016-03-01    Value  11.432
6  2015-02-01    Value  13.031
7  2016-03-01    Value  20.784
8  2014-02-02    Value   99.01
9  2014-02-02    Value       1

## ================= Group By =================

In [131]:
 pd.DataFrame(data2).groupby(by=['Date','Type']).sum()

                   Value
Date       Type
2014-02-02 a     100.010
2015-02-01 b      13.031
2016-03-01 a      11.432
           c      20.784

In [133]:
 pd.DataFrame(data2).duplicated('Date')

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [219]:
df.loc[df.Value > 20]

         Date Type   Value
2  2016-03-01    c  20.784
3  2014-02-02    a  99.010

In [224]:
df.loc[:, df.notnull().any()]

         Date Type   Value
0  2016-03-01    a  11.432
1  2015-02-01    b  13.031
2  2016-03-01    c  20.784
3  2014-02-02    a  99.010
4  2014-02-02    b   1.000

In [218]:
df.where(df.Value > 20)

         Date Type   Value
0         NaN  NaN     NaN
1         NaN  NaN     NaN
2  2016-03-01    c  20.784
3  2014-02-02    a  99.010
4         NaN  NaN     NaN

In [211]:
df.query('Type == "a"')

         Date Type   Value
0  2016-03-01    a  11.432
3  2014-02-02    a  99.010

In [315]:
df3 = pd.DataFrame({
    'AAA': [4,5,6,7],
    'BBB': [10,20,30,40],
    'CCC': [100,50,-30,-50]
})
# df3.loc[(df3.AAA.notnull()) & (df3.AAA >= 5 ), 'Status'] = True
# df3
df4=df3.copy()

#ab = df3.loc[(df3.AAA.notnull()) & (df3.AAA >= 5 ), 'Status'] = True
#print(ab)

   AAA  BBB  CCC Status
0    4   10  100    NaN
1    5   20   50   True
2    6   30  -30   True
3    7   40  -50   True

In [379]:
df3 = pd.DataFrame({
    'AAA': [0,5,6,7],
    'BBB': [10,20,30,40],
    'CCC': [100,50,-30,-50]
})

df_mask = pd.DataFrame({'AAA': [True] * 4, 'BBB': [False] * 4, 'CCC': [True, False] * 2})
#df_mask
# print(df3)
df4=df3.copy()

df4.where( (df3 >= 0 ), '')
# print(df4)

   AAA  BBB  CCC
0    0   10  100
1    5   20   50
2    6   30
3    7   40

In [381]:
df = pd.DataFrame({'host': ['other', 'other', 'that', 'this', 'this'], 
                   'service': ['mail', 'web', 'mail', 'mail', 'web'],
   'no': [1, 2, 1, 2, 1]}).set_index(['host', 'service'])
mask = df.groupby(level=0).agg('idxmax')

print(mask)

                 no
host
other  (other, web)
that   (that, mail)
this   (this, mail)